sources/day_03/simpleTempFoam/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }

    outlet          
    {
        type            zeroGradient;
    }

    wall       
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    hot_wall       
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    emptyFaces
    {
        type           empty;
    }
}

// ************************************************************************* //
