sources/day_03/simpleTempFoam/case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
	{
		type            freestream;
        freestreamValue $internalField;
	}
	
	outlet
	{
		type            freestream;
        freestreamValue $internalField;
	}
	
	wall       
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    hot_wall       
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    
    emptyFaces
    {
        type           empty;
    }
}

// ************************************************************************* //
