sources/day_03/simpleTempFoam/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

a1 5;
a2 10;
a3 15;
b 1;
h 0.01;
wa 70;
wb 20;

vertices
(
    (0 0 0)
    ($a1 0 0)
    ($a2 0 0)
    ($a3 0 0)
    ($a3 $b 0)
    ($a2 $b 0)
    ($a1 $b 0)
    (0 $b 0)
    (0 0 $h)
    ($a1 0 $h)
    ($a2 0 $h)
    ($a3 0 $h)
    ($a3 $b $h)
    ($a2 $b $h)
    ($a1 $b $h)
    (0 $b $h)
);

edged
(
);

blocks
(
    hex (0 1 6 7 8 9 14 15)   ($wa $wb 1) simpleGrading (1 1 1)
    hex (1 2 5 6 9 10 13 14)  ($wa $wb 1) simpleGrading (1 1 1)
    hex (2 3 4 5 10 11 12 13) ($wa $wb 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (0 7 15 8)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (3 11 12 4)
        );
    }

    hot_wall
    {
        type wall;
        faces
        (
            (5 13 14 6)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (6 14 15 7)
            (4 12 13 5)
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
        );
    }
    
    emptyFaces
    {
        type empty;
        faces
        (
            (0 7 6 1)
            (1 6 5 2)
            (2 5 4 3)
            (8 9 14 15)
            (9 10 13 14)
            (10 11 12 13)
        );
    }
);

// ************************************************************************* //
